In [2]:
import pandas as pd

In [4]:
#------------------------------------------------------------------------------
# Step 1
#------------------------------------------------------------------------------
# Load the UN_tourism_inbound_Arrivals_haiti for cleaning
df= pd.read_csv("UN_tourism_inbound_Arrivals_haiti.csv")
df.head()

,indicator_code,indicator_label,indicator_previous_code,reporter_area_code,reporter_area_label,partner_area_code,partner_area_label,year,value,flag,flag_label,unit,notes,drop
0,INBD_TRIP_TOTL_CRUS_EXCR,inbound - trips - total - cruise ships - same-...,CP_1_4,332,Haiti,999,World,1995,225.0,NaN,NaN,thousand trips,NaN,NaN
1,INBD_TRIP_TOTL_CRUS_EXCR,inbound - trips - total - cruise ships - same-...,CP_1_4,332,Haiti,999,World,1996,250.0,NaN,NaN,thousand trips,NaN,NaN
2,INBD_TRIP_TOTL_CRUS_EXCR,inbound - trips - total - cruise ships - same-...,CP_1_4,332,Haiti,999,World,1997,238.0,NaN,NaN,thousand trips,NaN,NaN
3,INBD_TRIP_TOTL_CRUS_EXCR,inbound - trips - total - cruise ships - same-...,CP_1_4,332,Haiti,999,World,1998,246.0,NaN,NaN,thousand trips,NaN,NaN
4,INBD_TRIP_TOTL_CRUS_EXCR,inbound - trips - total - cruise ships - same-...,CP_1_4,332,Haiti,999,World,1999,243.0,NaN,NaN,thousand trips,NaN,NaN

In [6]:
# Dropping empty and irrelevant columns to clean the dataset for analysis  
df_arrivals_haiti = df.drop(columns=["indicator_code", "indicator_previous_code", "indicator_previous_code","reporter_area_code",
                                "partner_area_code", "flag", "flag_label","notes","drop"])

In [8]:
# Rename indicator label categories to standardize types of visitors 
df_arrivals_haiti["indicator_label"] = df_arrivals_haiti["indicator_label"].replace({
    "inbound - trips - total - cruise ships - same-day visitors (excursionists)": "excursionists",
    "inbound - trips - total - total - overnight visitors (tourists)": "tourists",
    "inbound - trips - total - total - same-day visitors (excursionists)": "excursionists",
    "inbound - trips - total - total - visitors": "visitors_total"
})

In [190]:
# rename columns for more clarity
df_arrivals_haiti = df_arrivals_haiti.rename(columns={
    "indicator_label": "type_of_visitors",
    "reporter_area_label": "country_receiving",
    "partner_area_label": "where_tourist_from",
    "value": "number_of_tourist",
    "unit" : "unit_thousand_trips"
})

In [192]:
# visualize the first five(5) lines of df_arrivals_haiti dataset
df_arrivals_haiti.head()

,type_of_visitors,country_receiving,where_tourist_from,year,number_of_tourist,unit_thousand_trips
0,excursionists,Haiti,World,1995,225.0,thousand trips
1,excursionists,Haiti,World,1996,250.0,thousand trips
2,excursionists,Haiti,World,1997,238.0,thousand trips
3,excursionists,Haiti,World,1998,246.0,thousand trips
4,excursionists,Haiti,World,1999,243.0,thousand trips

In [194]:
# see the shape of the dataset 
df_arrivals_haiti.shape

(106, 6)

In [196]:
# save the cleaned dataset in a csv file
df_arrivals_haiti.to_csv("UN_tourism_inbound_Arrivals_haiti_cleaned.csv",index=False)

In [20]:
#------------------------------------------------------------------------------------
# step 2
#------------------------------------------------------------------------------------
# Load the UN_tourism_inbound_Arrivals_haiti_by_purpose for cleaning
df_purpose = pd.read_csv("UN_tourism_inbound_Arrivals_haiti_by_purpose.csv")
df_purpose.head()

,indicator_code,indicator_label,indicator_previous_code,reporter_area_code,reporter_area_label,partner_area_code,partner_area_label,year,value,flag,flag_label,unit,notes,drop
0,INBD_TRIP_PRPS_BNSS_TOUR,inbound - trips - by purpose - business - over...,CP_1_18,332,Haiti,999,World,1995,26.0,NaN,NaN,thousand trips,NaN,NaN
1,INBD_TRIP_PRPS_BNSS_TOUR,inbound - trips - by purpose - business - over...,CP_1_18,332,Haiti,999,World,1997,27.0,NaN,NaN,thousand trips,NaN,NaN
2,INBD_TRIP_PRPS_BNSS_TOUR,inbound - trips - by purpose - business - over...,CP_1_18,332,Haiti,999,World,1998,27.0,NaN,NaN,thousand trips,NaN,NaN
3,INBD_TRIP_PRPS_BNSS_TOUR,inbound - trips - by purpose - business - over...,CP_1_18,332,Haiti,999,World,1999,26.0,NaN,NaN,thousand trips,NaN,NaN
4,INBD_TRIP_PRPS_BNSS_TOUR,inbound - trips - by purpose - business - over...,CP_1_18,332,Haiti,999,World,2003,18.0,NaN,NaN,thousand trips,NaN,NaN

In [22]:
# Dropping empty and irrelevant columns to clean the dataset for analysis  
df_purpose = df.drop(columns=["indicator_code", "indicator_previous_code", "indicator_previous_code","reporter_area_code",
                                "partner_area_code", "flag", "flag_label","notes","drop"])

In [28]:
# see the different types of vivsitors by purpose in indicators_label
df_purpose["indicator_label"].unique()

array(['inbound - trips - by purpose - business - overnight visitors (tourists)',
       'inbound - trips - by purpose - personal - overnight visitors (tourists)',
       'inbound - trips - by purpose - total - overnight visitors (tourists)'],
      dtype=object)

In [30]:
# Rename indicator label categories to standardize types of visitors
df_purpose["indicator_label"] = df_purpose["indicator_label"].replace({
    "inbound - trips - by purpose - business - overnight visitors (tourists)": "business",
    "inbound - trips - by purpose - personal - overnight visitors (tourists)": "personal",
    "inbound - trips - by purpose - total - overnight visitors (tourists)": "total"})

In [180]:
# rename columns for more clarity
df_purpose = df_purpose.rename(columns={
    "indicator_label": "purpose_of_visites",
    "reporter_area_label": "country_receiving",
    "partner_area_label": "where_tourist_from",
    "value": "number_of_tourist_by_purpose",
    "unit" : "unit_thousans_trips"
})

In [182]:
df_purpose.head()

,purpose_of_visites,country_receiving,where_tourist_from,year,number_of_tourist_by_purpose,unit_thousans_trips
0,business,Haiti,World,1995,26.0,thousand trips
1,business,Haiti,World,1997,27.0,thousand trips
2,business,Haiti,World,1998,27.0,thousand trips
3,business,Haiti,World,1999,26.0,thousand trips
4,business,Haiti,World,2003,18.0,thousand trips

In [184]:
df_purpose["purpose_of_visites"].unique()

array(['business', 'personal', 'total'], dtype=object)

In [186]:
df_purpose.shape

(66, 6)

In [188]:
# save the cleaned data 
df_purpose.to_csv("UN_tourism_inbound_Arrivals_haiti_by_purpose_cleaned.csv",index=False)

In [44]:
#----------------------------------------------------------------------------------
#step 3
#----------------------------------------------------------------------------------
 # Load the UN_tourism_inbound_Arrivals_haiti_by_expenditure for cleaning
df_expenditure= pd.read_csv("UN_tourism_inbound_Arrivals_haiti_by_expenditure.csv")
df_expenditure.head()

,indicator_code,indicator_label,indicator_previous_code,reporter_area_code,reporter_area_label,partner_area_code,partner_area_label,year,value,flag,flag_label,unit,notes,drop
0,INBD_EXPD_BPAY_TRVL_VSTR,inbound - expenditure - balance of payments - ...,CP_1_34,332,Haiti,999,World,1995,90.0,NaN,NaN,million US dollars (nominal values),NaN,NaN
1,INBD_EXPD_BPAY_TRVL_VSTR,inbound - expenditure - balance of payments - ...,CP_1_34,332,Haiti,999,World,1996,96.0,NaN,NaN,million US dollars (nominal values),NaN,NaN
2,INBD_EXPD_BPAY_TRVL_VSTR,inbound - expenditure - balance of payments - ...,CP_1_34,332,Haiti,999,World,1997,107.0,NaN,NaN,million US dollars (nominal values),NaN,NaN
3,INBD_EXPD_BPAY_TRVL_VSTR,inbound - expenditure - balance of payments - ...,CP_1_34,332,Haiti,999,World,1998,131.0,NaN,NaN,million US dollars (nominal values),NaN,NaN
4,INBD_EXPD_BPAY_TRVL_VSTR,inbound - expenditure - balance of payments - ...,CP_1_34,332,Haiti,999,World,1999,135.0,NaN,NaN,million US dollars (nominal values),NaN,NaN

In [46]:
df_expenditure["indicator_label"].unique()

array(['inbound - expenditure - balance of payments - travel - visitors'],
      dtype=object)

In [52]:
# Dropping empty and irrelevant columns to clean the dataset for analysis  
df_expenditure = df_expenditure.drop(columns=["indicator_code", "indicator_previous_code", "indicator_previous_code","reporter_area_code",
                                "partner_area_code", "flag", "flag_label","notes","drop"])

In [56]:
# Rename indicator label categories to standardize types of visitors
df_expenditure["indicator_label"] = df_expenditure["indicator_label"].replace({
    "inbound - expenditure - balance of payments - travel - visitors": "expenditures",
})

In [166]:
# rename columns for more clarity
df_expenditure = df_expenditure.rename(columns={
    "indicator_label": "visitors_expenditure_by_year",
    "reporter_area_label": "country_receiving",
    "partner_area_label": "where_tourist_from",
    "value": "amount_spent",
    "unit" : "unit_US_dollars"
})

In [168]:
df_expenditure.head()

,visitors_expenditure_by_year,country_receiving,where_tourist_from,year,amount_spent,unit_US_dollars
0,visitors_total_expenditure,Haiti,World,1995,90.0,million US dollars (nominal values)
1,visitors_total_expenditure,Haiti,World,1996,96.0,million US dollars (nominal values)
2,visitors_total_expenditure,Haiti,World,1997,107.0,million US dollars (nominal values)
3,visitors_total_expenditure,Haiti,World,1998,131.0,million US dollars (nominal values)
4,visitors_total_expenditure,Haiti,World,1999,135.0,million US dollars (nominal values)

In [170]:
df_expenditure.shape

(28, 6)

In [178]:
# save the cleaned data 
df_expenditure.to_csv("UN_tourism_inbound_Arrivals_haiti_by_expenditure_cleaned.csv",index=False)

In [ ]:
#--------------------------------------------------------------------------------------------
# step 4
#--------------------------------------------------------------------------------------------

In [142]:
 # Load the UN_tourism_inbound_Arrivals_haiti_by_transport for cleaning
df_transport = pd.read_csv("UN_tourism_inbound_Arrivals_haiti_by_transport.csv")
df_transport .head()

,indicator_code,indicator_label,indicator_previous_code,reporter_area_code,reporter_area_label,partner_area_code,partner_area_label,year,value,flag,flag_label,unit,notes,drop
0,INBD_TRIP_TRPT_AIRT_TOUR,inbound - trips - transport - air - overnight ...,CP_1_20,332,Haiti,999,World,1995,145.0,NaN,NaN,thousand trips,NaN,NaN
1,INBD_TRIP_TRPT_AIRT_TOUR,inbound - trips - transport - air - overnight ...,CP_1_20,332,Haiti,999,World,1996,150.0,NaN,NaN,thousand trips,NaN,NaN
2,INBD_TRIP_TRPT_AIRT_TOUR,inbound - trips - transport - air - overnight ...,CP_1_20,332,Haiti,999,World,1997,149.0,NaN,NaN,thousand trips,NaN,NaN
3,INBD_TRIP_TRPT_AIRT_TOUR,inbound - trips - transport - air - overnight ...,CP_1_20,332,Haiti,999,World,1998,147.0,NaN,NaN,thousand trips,NaN,NaN
4,INBD_TRIP_TRPT_AIRT_TOUR,inbound - trips - transport - air - overnight ...,CP_1_20,332,Haiti,999,World,1999,143.0,NaN,NaN,thousand trips,NaN,NaN

In [144]:
# Dropping empty and irrelevant columns to clean the dataset for analysis  
df_transport = df_transport.drop(columns=["indicator_code", "indicator_previous_code", "indicator_previous_code","reporter_area_code",
                                "partner_area_code", "flag", "flag_label","notes","drop"])

In [150]:
df_transport["indicator_label"].unique()

array(['inbound - trips - transport - air - overnight visitors (tourists)',
       'inbound - trips - transport - total - overnight visitors (tourists)',
       'inbound - trips - transport - water - overnight visitors (tourists)'],
      dtype=object)

In [152]:
# Rename indicator label categories to standardize types of visitors 
df_transport["indicator_label"] = df_transport["indicator_label"].replace({
    "inbound - trips - transport - air - overnight visitors (tourists)": "air",
    "inbound - trips - transport - total - overnight visitors (tourists)": "all_way_transport",
    "inbound - trips - transport - water - overnight visitors (tourists)": "water",
})

In [154]:
#visualize the 5 lines of df_transport
df_transport.head()

,indicator_label,reporter_area_label,partner_area_label,year,value,unit
0,air,Haiti,World,1995,145.0,thousand trips
1,air,Haiti,World,1996,150.0,thousand trips
2,air,Haiti,World,1997,149.0,thousand trips
3,air,Haiti,World,1998,147.0,thousand trips
4,air,Haiti,World,1999,143.0,thousand trips

In [158]:
# rename columns for more clarity
df_transport = df_transport.rename(columns={
    "indicator_label": "way_of_transport",
    "reporter_area_label": "country_receiving",
    "partner_area_label": "where_tourist_from",
    "value": "number_of_trips"
})

In [200]:
#visualize the 5 lines of df_transport
df_transport.head()

,way_of_transport,country_receiving,where_tourist_from,year,number_of_trips,unit
0,air,Haiti,World,1995,145.0,thousand trips
1,air,Haiti,World,1996,150.0,thousand trips
2,air,Haiti,World,1997,149.0,thousand trips
3,air,Haiti,World,1998,147.0,thousand trips
4,air,Haiti,World,1999,143.0,thousand trips

In [162]:
# save the cleaned dataset to a csv file.
df_transport.to_csv("UN_tourism_inbound_Arrivals_haiti_by_transport_cleaned.csv",index=False)